org-content/hugo.org
#+STARTUP: content
#+options: author:nil
#+HUGO_BASE_DIR: ../
#+hugo_level_offset: 0


** DONE What I'm Doing Now
CLOSED: [2020-12-02 Wed 09:47]
:PROPERTIES:
:EXPORT_HUGO_BUNDLE: now
:EXPORT_FILE_NAME: index
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :narrow true
:END:

(This is a [[https://nownownow.com/about][now]] page. If you have your own site, [[https://nownownow.com/about][consider making one too!]])


*** Artifai

I'm leading the development of Artifai. Our goal is to making neural style technology available to non technical users, while streamlining the process for users to purchase their art on a poster/canvas. You can check it out at [[https://firebasestorage.googleapis.com/v0/b/artifai.appspot.com/o/architecture%2FArtifaication%20Pipeline.png?alt=media&token=1634450b-3187-432f-b910-2332856cfe37][https://artif.ai]].

*** McGill

I'm a U2 honors math and computer science at McGill. My list of coursework is [[https://colekillian.com/coursework-overview/][here]].

*** Skills In Progress
(inspired by [[https://jamesbvaughan.com/skills-in-progress/][james vaughan]])

One thing that helps me stay happier and more energized is to always be working on developing a skill. As Willy Wonka says, we have "so much time and so little to do".

**** Current
These are skills that I'm currently working on.

- Fullstack Development
- Competitive Programming
- Acoustic Guitar and Singing
- Writing
- 1 Minute Handstand
- Leadership
- Storytelling

**** Backlog
These are skills that I'm excited to work on, but that I'm not making time for just yet.

- Electric Guitar
- Solve a Rubik's Cube Blindfolded
- YouTube channel
- Straddle Planche
- Reinforcement Learning
- Marathon
  
**** Back-Backlog
These are skills that I hope to get to eventually, but it could be a while.

- Paint
- Piano
- Biology

**** Past
These are skills I have developed in the past.

- Standing Backflip
- Basketball Finger Spin
- 150 Soccer Juggles
- Unicycle
- Magic Card Tricks
- Bike Wheelie
  
