content/_about/now/index.md
+++
title = "What I'm Doing Now"
date = 2020-12-02T09:47:00-05:00
draft = false
weight = 2002
narrow = true
+++

(This is a [now](https://nownownow.com/about) page. If you have your own site, [consider making one too!](https://nownownow.com/about))


# Artifai {#artifai}

I'm leading the development of Artifai. Our goal is to making neural style technology available to non technical users, while streamlining the process for users to purchase their art on a poster/canvas. You can check it out at [https://artif.ai](https://firebasestorage.googleapis.com/v0/b/artifai.appspot.com/o/architecture%2FArtifaication%20Pipeline.png?alt=media&token=1634450b-3187-432f-b910-2332856cfe37).


# McGill {#mcgill}

I'm a U2 honors math and computer science at McGill. My list of coursework is [here](https://colekillian.com/coursework-overview/).


# Skills In Progress {#skills-in-progress}

(inspired by [james vaughan](https://jamesbvaughan.com/skills-in-progress/))

One thing that helps me stay happier and more energized is to always be working on developing a skill. As Willy Wonka says, we have "so much time and so little to do".


## Current {#current}

These are skills that I'm currently working on.

-   Fullstack Development
-   Competitive Programming
-   Acoustic Guitar and Singing
-   Writing
-   1 Minute Handstand
-   Leadership
-   Storytelling


## Backlog {#backlog}

These are skills that I'm excited to work on, but that I'm not making time for just yet.

-   Electric Guitar
-   Solve a Rubik's Cube Blindfolded
-   YouTube channel
-   Straddle Planche
-   Reinforcement Learning
-   Marathon


## Back-Backlog {#back-backlog}

These are skills that I hope to get to eventually, but it could be a while.

-   Paint
-   Piano
-   Biology


## Past {#past}

These are skills I have developed in the past.

-   Standing Backflip
-   Basketball Finger Spin
-   150 Soccer Juggles
-   Unicycle
-   Magic Card Tricks
-   Bike Wheelie
